bin/src/main/resources/XML/Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:dan="http://dancuquocgia.bca"/>
    <soapenv:Body xmlns:dan="http://dancuquocgia.bca">
        <ns1:CongdanCollection xmlns:ns1="http://www.mic.gov.vn/dancu/1.0">
            <ns1:CongDan>
                <ns1:SoDinhDanh>100000010836</ns1:SoDinhDanh>
                <ns1:SoCMND>222222222</ns1:SoCMND>
                <ns1:HoVaTen>
                    <ns1:Ho/>
                    <ns1:ChuDem/>
                    <ns1:Ten>ĐẶNG LINH KIM</ns1:Ten>
                </ns1:HoVaTen>
                <ns1:GioiTinh>1</ns1:GioiTinh>
                <ns1:DanToc>01</ns1:DanToc>
                <ns1:TonGiao>00</ns1:TonGiao>
                <ns1:TinhTrangHonNhan>3</ns1:TinhTrangHonNhan>
                <ns1:NhomMau>00</ns1:NhomMau>
                <ns1:NgayThangNamSinh>
                    <ns1:Nam>1955</ns1:Nam>
                    <ns1:NgayThangNam>19550510</ns1:NgayThangNam>
                </ns1:NgayThangNamSinh>
                <ns1:NoiDangKyKhaiSinh>
                    <ns1:MaTinhThanh>51</ns1:MaTinhThanh>
                    <ns1:MaQuanHuyen>524</ns1:MaQuanHuyen>
                    <ns1:MaPhuongXa>21112</ns1:MaPhuongXa>
                    <ns1:ChiTiet/>
                    <ns1:QuocGia>VN</ns1:QuocGia>
                </ns1:NoiDangKyKhaiSinh>
                <ns1:QuocTich/>
                <ns1:QueQuan>
                    <ns1:MaTinhThanh>51</ns1:MaTinhThanh>
                    <ns1:MaQuanHuyen>524</ns1:MaQuanHuyen>
                    <ns1:MaPhuongXa>21112</ns1:MaPhuongXa>
                    <ns1:ChiTiet/>
                    <ns1:QuocGia>VN</ns1:QuocGia>
                </ns1:QueQuan>
                <ns1:ThuongTru>
                    <ns1:MaTinhThanh>68</ns1:MaTinhThanh>
                    <ns1:MaQuanHuyen>681</ns1:MaQuanHuyen>
                    <ns1:MaPhuongXa>25108</ns1:MaPhuongXa>
                    <ns1:ChiTiet>THÔN 1</ns1:ChiTiet>
                    <ns1:QuocGia>VN</ns1:QuocGia>
                </ns1:ThuongTru>
                <ns1:NoiOHienTai>
                    <ns1:MaTinhThanh>68</ns1:MaTinhThanh>
                    <ns1:MaQuanHuyen>681</ns1:MaQuanHuyen>
                    <ns1:MaPhuongXa>25108</ns1:MaPhuongXa>
                    <ns1:ChiTiet>THÔN 1</ns1:ChiTiet>
                    <ns1:QuocGia>VN</ns1:QuocGia>
                </ns1:NoiOHienTai>
                <ns1:Cha>
                    <ns1:HoVaTen>ĐẶNG HƯƠNG</ns1:HoVaTen>
                    <ns1:QuocTich>VN</ns1:QuocTich>
                    <ns1:SoDinhDanh/>
                    <ns1:SoCMND/>
                </ns1:Cha>
                <ns1:Me>
                    <ns1:HoVaTen>PHẠM THỊ NHÌ</ns1:HoVaTen>
                    <ns1:QuocTich>VN</ns1:QuocTich>
                    <ns1:SoDinhDanh/>
                    <ns1:SoCMND/>
                </ns1:Me>
                <ns1:VoChong>
                    <ns1:HoVaTen/>
                    <ns1:QuocTich/>
                    <ns1:SoDinhDanh/>
                    <ns1:SoCMND/>
                </ns1:VoChong>
                <ns1:NguoiDaiDien>
                    <ns1:HoVaTen/>
                    <ns1:QuocTich/>
                    <ns1:SoDinhDanh/>
                    <ns1:SoCMND/>
                </ns1:NguoiDaiDien>
                <ns1:ChuHo>
                    <ns1:QuanHe>CH01</ns1:QuanHe>
                    <ns1:SoDinhDanh/>
                    <ns1:SoCMND>250325707</ns1:SoCMND>
                    <ns1:HoVaTen>ĐẶNG LINH KIM</ns1:HoVaTen>
                </ns1:ChuHo>
                <ns1:SoSoHoKhau>25108-000361</ns1:SoSoHoKhau>
            </ns1:CongDan>
        </ns1:CongdanCollection>
    </soapenv:Body>
</soapenv:Envelope>